sorosaulong-ux/gd32-test-project/Library/gd32a7xx_sram_tcm.c
/*!
    \brief      clear tcm error flag (API_ID: 0x0013U)
    \param[in]  tcm_id: specify tcm id
                only one parameter can be selected which is shown as below:
      \arg        TCM_ID_ITCM0  : ITCM of CM7_0
      \arg        TCM_ID_D0TCM0 : D0TCM of CM7_0
      \arg        TCM_ID_D1TCM0 : D1TCM of CM7_0
      \arg        TCM_ID_ITCM1  : ITCM of CM7_1
      \arg        TCM_ID_D0TCM1 : D0TCM of CM7_1
      \arg        TCM_ID_D1TCM1 : D1TCM of CM7_1
    \param[in]  flag: specify clear which flag
                only one parameter can be selected which is shown as below:
      \arg        TCM_FLAG_CTLERR : controller redundancy check error flag
      \arg        TCM_FLAG_ECCCERR: ECC single bit correctable error flag
      \arg        TCM_FLAG_ADDRERR: ECC single bit address error flag
      \arg        TCM_FLAG_ECCUERR: ECC double bit uncorrectable error flag
      \arg        TCM_FLAG_EDCERR : EDC after ECC checker error flag
    \param[out] none
    \retval     none
*/
void tcm_error_flag_clear(uint32_t tcm_id, uint32_t flag)
{
    uint32_t bit_offset;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_TCM_ID(tcm_id)) {
        fw_debug_report_err(SRAM_TCM_MODULE_ID, API_ID(19U), ERR_PARAM_INVALID);
    } else if(NOT_TCM_GET_FLAG(flag)) {
        fw_debug_report_err(SRAM_TCM_MODULE_ID, API_ID(19U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get bit offset of flag */
        if(TCM_FLAG_CTLERR == flag) {
            if(tcm_id <= TCM_ID_D1TCM0) {
                bit_offset = 0;
            } else {
                bit_offset = 1;
            }
        } else {
            bit_offset = tcm_id;
        }
        /* clear flag by writing 1 */
        TCM_ERR = (flag << bit_offset);
    }
}

/*!
    \brief      get tcm single bit ecc error address (API_ID: 0x0014U)
    \param[in]  tcm_id: specify tcm id
                only one parameter can be selected which is shown as below:
      \arg        TCM_ID_ITCM0  : ITCM of CM7_0
      \arg        TCM_ID_D0TCM0 : D0TCM of CM7_0
      \arg        TCM_ID_D1TCM0 : D1TCM of CM7_0
      \arg        TCM_ID_ITCM1  : ITCM of CM7_1
      \arg        TCM_ID_D0TCM1 : D0TCM of CM7_1
      \arg        TCM_ID_D1TCM1 : D1TCM of CM7_1
    \param[in]  address_index: single bit ecc error address index
                only one parameter can be selected which is shown as below:
      \arg        ECC_CBE_ADDRESS0 : single bit ecc error address index0
      \arg        ECC_CBE_ADDRESS1 : single bit ecc error address index1
      \arg        ECC_CBE_ADDRESS2 : single bit ecc error address index2
      \arg        ECC_CBE_ADDRESS3 : single bit ecc error address index3
    \param[out] none
    \retval     tcm single bit ecc error address
*/
uint32_t tcm_ecc_single_bit_address_get(uint32_t tcm_id, uint32_t address_index)
{
    uint32_t reg_addr = 0;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_TCM_ID(tcm_id)) {
        fw_debug_report_err(SRAM_TCM_MODULE_ID, API_ID(20U), ERR_PARAM_INVALID);
    } else if(NOT_TCM_ADDRESS_INDEX(address_index)) {
        fw_debug_report_err(SRAM_TCM_MODULE_ID, API_ID(20U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(address_index) {
        case ECC_CBE_ADDRESS0:
            reg_addr = TCM_CBEADDR0(tcm_id);
            break;
        case ECC_CBE_ADDRESS1:
            reg_addr = TCM_CBEADDR1(tcm_id);
            break;
        case ECC_CBE_ADDRESS2:
            reg_addr = TCM_CBEADDR2(tcm_id);
            break;
        case ECC_CBE_ADDRESS3:
            reg_addr = TCM_CBEADDR3(tcm_id);
            break;
        default:
            reg_addr = 0;
            break;
        }
    }
    return reg_addr;
}

/*!
    \brief      get tcm double bit ecc error address (API_ID: 0x0015U)
    \param[in]  tcm_id: specify tcm id
                only one parameter can be selected which is shown as below:
      \arg        TCM_ID_ITCM0  : ITCM of CM7_0
      \arg        TCM_ID_D0TCM0 : D0TCM of CM7_0
      \arg        TCM_ID_D1TCM0 : D1TCM of CM7_0
      \arg        TCM_ID_ITCM1  : ITCM of CM7_1
      \arg        TCM_ID_D0TCM1 : D0TCM of CM7_1
      \arg        TCM_ID_D1TCM1 : D1TCM of CM7_1
    \param[out] none
    \retval      tcm double bit ecc error address
*/
uint32_t tcm_ecc_double_bit_address_get(uint32_t tcm_id)
{
    uint32_t reg_addr = 0;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_TCM_ID(tcm_id)) {
        fw_debug_report_err(SRAM_TCM_MODULE_ID, API_ID(21U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg_addr = TCM_UBEADDR(tcm_id);
    }
    return reg_addr;
}

/*!
    \brief      get tcm single bit ecc error address valid status (API_ID: 0x0016U)
    \param[in]  tcm_id: specify tcm id
                only one parameter can be selected which is shown as below:
      \arg        TCM_ID_ITCM0  : ITCM of CM7_0
      \arg        TCM_ID_D0TCM0 : D0TCM of CM7_0
      \arg        TCM_ID_D1TCM0 : D1TCM of CM7_0
      \arg        TCM_ID_ITCM1  : ITCM of CM7_1
      \arg        TCM_ID_D0TCM1 : D0TCM of CM7_1
      \arg        TCM_ID_D1TCM1 : D1TCM of CM7_1
    \param[in]  address_index: single bit ecc error address index
                only one parameter can be selected which is shown as below:
      \arg        ECC_CBE_ADDRESS0 : single bit ecc error address index0
      \arg        ECC_CBE_ADDRESS1 : single bit ecc error address index1
      \arg        ECC_CBE_ADDRESS2 : single bit ecc error address index2
      \arg        ECC_CBE_ADDRESS3 : single bit ecc error address index3
    \param[out] none
    \retval     FlagStatus: SET (address valid) or RESET (invalid address)
*/
FlagStatus tcm_ecc_single_bit_address_valid_get(uint32_t tcm_id, uint32_t address_index)
{
    FlagStatus retval = RESET;
    uint32_t bit_pos;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_TCM_ID(tcm_id)) {
        fw_debug_report_err(SRAM_TCM_MODULE_ID, API_ID(22U), ERR_PARAM_INVALID);
    } else if(NOT_TCM_ADDRESS_INDEX(address_index)) {
        fw_debug_report_err(SRAM_TCM_MODULE_ID, API_ID(22U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        bit_pos = tcm_id * 0x4U + address_index;
        if(0U != (TCM_BUFVLD & BIT(bit_pos))) {
            retval = SET;
        } else {
            retval = RESET;
        }
    }
    return retval;
}

/*!
    \brief      get tcm double bit ecc error address valid status (API_ID: 0x0017U)
    \param[in]  tcm_id: specify tcm id
                only one parameter can be selected which is shown as below:
      \arg        TCM_ID_ITCM0  : ITCM of CM7_0
      \arg        TCM_ID_D0TCM0 : D0TCM of CM7_0
      \arg        TCM_ID_D1TCM0 : D1TCM of CM7_0
      \arg        TCM_ID_ITCM1  : ITCM of CM7_1
      \arg        TCM_ID_D0TCM1 : D0TCM of CM7_1
      \arg        TCM_ID_D1TCM1 : D1TCM of CM7_1
    \param[out] none
    \retval     FlagStatus: SET (address valid) or RESET (invalid address)
*/
FlagStatus tcm_ecc_double_bit_address_valid_get(uint32_t tcm_id)
{
    FlagStatus retval = RESET;
    uint32_t bit_pos;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_TCM_ID(tcm_id)) {
        fw_debug_report_err(SRAM_TCM_MODULE_ID, API_ID(23U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        bit_pos = tcm_id + TCM_BUFVLD_UBEADDRVLD_OFFSET;
        if(0U != (TCM_BUFVLD & BIT(bit_pos))) {
            retval = SET;
        } else {
            retval = RESET;
        }
    }
    return retval;
}

/*!
    \brief      clear tcm single bit ecc error address valid status (API_ID: 0x0018U)
    \param[in]  tcm_id: specify tcm id
                only one parameter can be selected which is shown as below:
      \arg        TCM_ID_ITCM0  : ITCM of CM7_0
      \arg        TCM_ID_D0TCM0 : D0TCM of CM7_0
      \arg        TCM_ID_D1TCM0 : D1TCM of CM7_0
      \arg        TCM_ID_ITCM1  : ITCM of CM7_1
      \arg        TCM_ID_D0TCM1 : D0TCM of CM7_1
      \arg        TCM_ID_D1TCM1 : D1TCM of CM7_1
    \param[in]  address_index: single bit ecc error address index
                only one parameter can be selected which is shown as below:
      \arg        ECC_CBE_ADDRESS0 : single bit ecc error address index0
      \arg        ECC_CBE_ADDRESS1 : single bit ecc error address index1
      \arg        ECC_CBE_ADDRESS2 : single bit ecc error address index2
      \arg        ECC_CBE_ADDRESS3 : single bit ecc error address index3
    \param[out] none
    \retval     none
*/
void tcm_ecc_single_bit_address_valid_clear(uint32_t tcm_id, uint32_t address_index)
{
    uint32_t bit_pos;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_TCM_ID(tcm_id)) {
        fw_debug_report_err(SRAM_TCM_MODULE_ID, API_ID(24U), ERR_PARAM_INVALID);
    } else if(NOT_TCM_ADDRESS_INDEX(address_index)) {
        fw_debug_report_err(SRAM_TCM_MODULE_ID, API_ID(24U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        bit_pos = tcm_id * 0x4U + address_index;
        /* clear flag by writing 1 */
        TCM_BUFVLD = BIT(bit_pos);
    }
}

/*!
    \brief      clear tcm double bit ecc error address valid status (API_ID: 0x0019U)
    \param[in]  tcm_id: specify tcm id
                only one parameter can be selected which is shown as below:
      \arg        TCM_ID_ITCM0  : ITCM of CM7_0
      \arg        TCM_ID_D0TCM0 : D0TCM of CM7_0
      \arg        TCM_ID_D1TCM0 : D1TCM of CM7_0
      \arg        TCM_ID_ITCM1  : ITCM of CM7_1
      \arg        TCM_ID_D0TCM1 : D0TCM of CM7_1
      \arg        TCM_ID_D1TCM1 : D1TCM of CM7_1
    \param[out] none
    \retval     none
*/
void tcm_ecc_double_bit_address_valid_clear(uint32_t tcm_id)
{
    uint32_t bit_pos;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_TCM_ID(tcm_id)) {
        fw_debug_report_err(SRAM_TCM_MODULE_ID, API_ID(25U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        bit_pos = tcm_id + TCM_BUFVLD_UBEADDRVLD_OFFSET;
        /* clear flag by writing 1 */
        TCM_BUFVLD = BIT(bit_pos);
    }
}

/*!
    \brief      get tcm single bit ecc error address buffer overflow status (API_ID: 0x001AU)
    \param[in]  tcm_id: specify tcm id
                only one parameter can be selected which is shown as below:
      \arg        TCM_ID_ITCM0  : ITCM of CM7_0
      \arg        TCM_ID_D0TCM0 : D0TCM of CM7_0
      \arg        TCM_ID_D1TCM0 : D1TCM of CM7_0
      \arg        TCM_ID_ITCM1  : ITCM of CM7_1
      \arg        TCM_ID_D0TCM1 : D0TCM of CM7_1
      \arg        TCM_ID_D1TCM1 : D1TCM of CM7_1
    \param[out] none
    \retval     FlagStatus: SET (overflow) or RESET (no overflow)
*/
FlagStatus tcm_error_address_buffer_overflow_get(uint32_t tcm_id)
{
    FlagStatus retval = RESET;
    uint32_t bit_pos;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_TCM_ID(tcm_id)) {
        fw_debug_report_err(SRAM_TCM_MODULE_ID, API_ID(26U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        bit_pos = tcm_id;
        if(0U != (TCM_OVF & BIT(bit_pos))) {
            retval = SET;
        } else {
            retval = RESET;
        }
    }
    return retval;
}

/*!
    \brief      clear tcm single bit ecc error address buffer overflow status (API_ID: 0x001BU)
    \param[in]  tcm_id: specify tcm id
                only one parameter can be selected which is shown as below:
      \arg        TCM_ID_ITCM0  : ITCM of CM7_0
      \arg        TCM_ID_D0TCM0 : D0TCM of CM7_0
      \arg        TCM_ID_D1TCM0 : D1TCM of CM7_0
      \arg        TCM_ID_ITCM1  : ITCM of CM7_1
      \arg        TCM_ID_D0TCM1 : D0TCM of CM7_1
      \arg        TCM_ID_D1TCM1 : D1TCM of CM7_1
    \param[out] none
    \retval     none
*/
void tcm_error_address_buffer_overflow_clear(uint32_t tcm_id)
{
    uint32_t bit_pos;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_TCM_ID(tcm_id)) {
        fw_debug_report_err(SRAM_TCM_MODULE_ID, API_ID(27U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        bit_pos = tcm_id;
        /* clear flag by writing 1 */
        TCM_OVF = BIT(bit_pos);
    }
}

/*!
    \brief      get tcm ecc code of detected ecc error (API_ID: 0x001CU)
    \param[in]  tcm_id: specify tcm id
                only one parameter can be selected which is shown as below:
      \arg        TCM_ID_ITCM0  : ITCM of CM7_0
      \arg        TCM_ID_D0TCM0 : D0TCM of CM7_0
      \arg        TCM_ID_D1TCM0 : D1TCM of CM7_0
      \arg        TCM_ID_ITCM1  : ITCM of CM7_1
      \arg        TCM_ID_D0TCM1 : D0TCM of CM7_1
      \arg        TCM_ID_D1TCM1 : D1TCM of CM7_1
    \param[out] none
    \retval    tcm ecc code
*/
uint32_t tcm_ecc_code_get(uint32_t tcm_id)
{
    uint32_t ecc_code = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_TCM_ID(tcm_id)) {
        fw_debug_report_err(SRAM_TCM_MODULE_ID, API_ID(28U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(tcm_id) {
        case TCM_ID_ITCM0:
            ecc_code = TCM0_ECCCERR & TCM0_ECCCERR_ITCM0_ECCCDET;
            break;
        case TCM_ID_D0TCM0:
            ecc_code = ((TCM0_ECCCERR & TCM0_ECCCERR_D0TCM0_ECCCDET) >> TCM0_ECCCERR_D0TCM0_ECCCDET_OFFSET);
            break;
        case TCM_ID_D1TCM0:
            ecc_code = ((TCM0_ECCCERR & TCM0_ECCCERR_D1TCM0_ECCCDET) >> TCM0_ECCCERR_D1TCM0_ECCCDET_OFFSET);
            break;
#if defined(GD32A74XX) || defined(GD32A72XX)
        case TCM_ID_ITCM1:
            ecc_code = (TCM1_ECCCERR & TCM1_ECCCERR_ITCM1_ECCCDET);
            break;
        case TCM_ID_D0TCM1:
            ecc_code = ((TCM1_ECCCERR & TCM1_ECCCERR_D0TCM1_ECCCDET) >> TCM1_ECCCERR_D0TCM0_ECCCDET_OFFSET);
            break;
        case TCM_ID_D1TCM1:
            ecc_code = ((TCM1_ECCCERR & TCM1_ECCCERR_D1TCM1_ECCCDET) >> TCM1_ECCCERR_D1TCM0_ECCCDET_OFFSET);
            break;
#endif /* defined(GD32A74XX) || defined(GD32A72XX) */
        default:
            ecc_code = 0U;
            break;
        }
    }
    return ecc_code;
}

/*!
    \brief      configure tcm write protection (API_ID: 0x001DU)
    \param[in]  wp_page: specify TCM write protection page
                one or more parameters can be selected which are shown as below:
      \arg        TCM_WP_ITCM0_Px(x=0..3) : ITCM of CM7_0 page x write protection bit
      \arg        TCM_WP_ITCM1_Px(x=0..3) : ITCM of CM7_1 page x write protection bit
      \arg        TCM_WP_DTCM0_Px(x=0..7) : DTCM of CM7_0 page x write protection bit
      \arg        TCM_WP_DTCM1_Px(x=0..7) : DTCM of CM7_1 page x write protection bit
      \arg        TCM_WP_ITCM0_ALL: ITCM of CM7_0 all page write protection bit
      \arg        TCM_WP_ITCM1_ALL: ITCM of CM7_1 all page write protection bit
      \arg        TCM_WP_DTCM0_ALL: DTCM of CM7_0 all page write protection bit
      \arg        TCM_WP_DTCM1_ALL: DTCM of CM7_1 all page write protection bit
      \arg        TCM_WP_ALL      : TCM of CM7_0/1 all page write protection bit
    \param[in]  enable: DISABLE or ENABLE
    \param[out] none
    \retval     none
*/
void tcm_write_protect_config(uint32_t wp_page, ControlStatus enable)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_TCM_WP_PAGE(wp_page)) {
        fw_debug_report_err(SRAM_TCM_MODULE_ID, API_ID(29U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(enable == ENABLE) {
            TCM_WP |= wp_page;
        } else {
            TCM_WP &= ~wp_page;
        }
    }
}

/*!
    \brief      get tcm write protection status (API_ID: 0x001EU)
    \param[in]  wp_page: specify TCM write protection page
                one or more parameters can be selected which are shown as below:
      \arg        TCM_WP_ITCM0_Px(x=0..3) : ITCM of CM7_0 page x write protection bit
      \arg        TCM_WP_ITCM1_Px(x=0..3) : ITCM of CM7_1 page x write protection bit
      \arg        TCM_WP_DTCM0_Px(x=0..7) : DTCM of CM7_0 page x write protection bit
      \arg        TCM_WP_DTCM1_Px(x=0..7) : DTCM of CM7_1 page x write protection bit
      \arg        TCM_WP_ITCM0_ALL: ITCM of CM7_0 all page write protection bit
      \arg        TCM_WP_ITCM1_ALL: ITCM of CM7_1 all page write protection bit
      \arg        TCM_WP_DTCM0_ALL: DTCM of CM7_0 all page write protection bit
      \arg        TCM_WP_DTCM1_ALL: DTCM of CM7_1 all page write protection bit
      \arg        TCM_WP_ALL      : TCM of CM7_0/1 all page write protection bit
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus tcm_write_protection_get(uint32_t wp_page)
{
    FlagStatus retval = RESET;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_TCM_WP_PAGE(wp_page)) {
        fw_debug_report_err(SRAM_TCM_MODULE_ID, API_ID(30U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(0U != (TCM_WP & wp_page)) {
            retval = SET;
        } else {
            retval = RESET;
        }
    }
    return retval;
}
